{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"trainable": true, "batch_input_shape": [null, 48, 48, 1], "padding": "same", "dtype": "float32", "strides": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [3, 3], "name": "conv2d_1", "data_format": "channels_last", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "bias_regularizer": null, "use_bias": true, "activation": "relu", "kernel_regularizer": null}}, {"class_name": "Conv2D", "config": {"trainable": true, "use_bias": true, "padding": "valid", "kernel_constraint": null, "strides": [1, 1], "filters": 32, "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [3, 3], "name": "conv2d_2", "data_format": "channels_last", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activation": "relu", "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "center": true, "beta_regularizer": null, "name": "batch_normalization_1", "gamma_constraint": null, "gamma_regularizer": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "momentum": 0.99}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "strides": [2, 2], "pool_size": [2, 2], "name": "max_pooling2d_1", "data_format": "channels_last", "padding": "same"}}, {"class_name": "Dropout", "config": {"trainable": true, "noise_shape": null, "seed": null, "rate": 0.1, "name": "dropout_1"}}, {"class_name": "Conv2D", "config": {"trainable": true, "use_bias": true, "padding": "same", "kernel_constraint": null, "strides": [1, 1], "filters": 64, "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [3, 3], "name": "conv2d_3", "data_format": "channels_last", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activation": "relu", "kernel_regularizer": null}}, {"class_name": "Conv2D", "config": {"trainable": true, "use_bias": true, "padding": "valid", "kernel_constraint": null, "strides": [1, 1], "filters": 64, "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [3, 3], "name": "conv2d_4", "data_format": "channels_last", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activation": "relu", "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "center": true, "beta_regularizer": null, "name": "batch_normalization_2", "gamma_constraint": null, "gamma_regularizer": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "momentum": 0.99}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "strides": [2, 2], "pool_size": [2, 2], "name": "max_pooling2d_2", "data_format": "channels_last", "padding": "valid"}}, {"class_name": "Dropout", "config": {"trainable": true, "noise_shape": null, "seed": null, "rate": 0.2, "name": "dropout_2"}}, {"class_name": "Conv2D", "config": {"trainable": true, "use_bias": true, "padding": "same", "kernel_constraint": null, "strides": [1, 1], "filters": 256, "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [3, 3], "name": "conv2d_5", "data_format": "channels_last", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activation": "relu", "kernel_regularizer": null}}, {"class_name": "Conv2D", "config": {"trainable": true, "use_bias": true, "padding": "valid", "kernel_constraint": null, "strides": [1, 1], "filters": 256, "bias_constraint": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [3, 3], "name": "conv2d_6", "data_format": "channels_last", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activation": "relu", "kernel_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "strides": [2, 2], "pool_size": [2, 2], "name": "max_pooling2d_3", "data_format": "channels_last", "padding": "valid"}}, {"class_name": "Dropout", "config": {"trainable": true, "noise_shape": null, "seed": null, "rate": 0.2, "name": "dropout_3"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"trainable": true, "use_bias": true, "units": 512, "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activation": "relu", "kernel_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "noise_shape": null, "seed": null, "rate": 0.3, "name": "dropout_4"}}, {"class_name": "Dense", "config": {"trainable": true, "use_bias": true, "units": 512, "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "name": "dense_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activation": "relu", "kernel_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "noise_shape": null, "seed": null, "rate": 0.3, "name": "dropout_5"}}, {"class_name": "Dense", "config": {"trainable": true, "use_bias": true, "units": 7, "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "name": "dense_3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activation": "softmax", "kernel_regularizer": null}}], "keras_version": "2.1.1"}